andersenthomas98/masteroppgave/nrf5sdk_thread/examples/multiprotocol/ble_thread/ble_thread_swi_template/main.c
    switch (event)
    {
        case BSP_EVENT_KEY_2:
            if (m_connection_state == CONNECTION_STATE_BLE)
            {
                if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
                {
                    m_connection_state = CONNECTION_STATE_BLE_DISCONNECT;
                }
                else
                {
                    m_connection_state = CONNECTION_STATE_BLE_DISABLE;
                }
            }
            break;

        case BSP_EVENT_KEY_3:
            if (m_connection_state == CONNECTION_STATE_THREAD)
            {
                m_connection_state = CONNECTION_STATE_THREAD_DISABLE;
            }
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break; // BSP_EVENT_DISCONNECT

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break; // BSP_EVENT_KEY_0

        default:
            break;
    }
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    ret_code_t             err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    switch (m_connection_state)
    {
        case CONNECTION_STATE_BLE:
        case CONNECTION_STATE_BLE_DISCONNECT:
        case CONNECTION_STATE_BLE_DISCONNECTING:
        case CONNECTION_STATE_BLE_DISABLE:
        {
            uint32_t err_code = sd_app_evt_wait();
            APP_ERROR_CHECK(err_code);
            break;
        }

        case CONNECTION_STATE_THREAD:
        case CONNECTION_STATE_THREAD_DISABLE:
        {
            if (!otTaskletsArePending(thread_ot_instance_get()))
            {
                __WFE();
            }
            break;
        }

        default:
            break;
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);

    err_code = bsp_indication_set(BSP_BLE_ENABLE);
    APP_ERROR_CHECK(err_code);

    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    conn_params_init();

    m_connection_state = CONNECTION_STATE_BLE;

    // Start advertising.
    advertising_start(m_erase_bonds);

    NRF_LOG_INFO("Current protocol: BLE\r\n");
}


/**@brief Disable BLE stack.
 */
static void ble_stack_deinit(void)
{
    uint32_t err_code;

    err_code = ble_conn_params_stop();
    APP_ERROR_CHECK(err_code);

    err_code = nrf_sdh_disable_request();
    APP_ERROR_CHECK(err_code);

    // Neither SoftDevice clears clock events after disabling, nor clock driver before enabling.
    // When the clock driver is enabled there is a pending event in the clock peripheral that leads
    // to incorrect state of the driver. Following workaround prevents this problem.
    nrf_clock_event_clear(NRF_CLOCK_EVENT_HFCLKSTARTED);

    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);
}


/**@section OpenThread stack management.
 */
static void thread_state_changed_callback(uint32_t flags, void * p_context)
{
    uint32_t err_code;

    NRF_LOG_INFO("State changed! Flags: 0x%08x Current role: %d\r\n",
                 flags, otThreadGetDeviceRole(p_context));

    if (flags & OT_CHANGED_THREAD_ROLE)
    {
        switch (otThreadGetDeviceRole(p_context))
        {
        case OT_DEVICE_ROLE_DETACHED:
        case OT_DEVICE_ROLE_DISABLED:
            err_code = bsp_indication_set(BSP_THREAD_ENABLE);
            APP_ERROR_CHECK(err_code);
            break;

        case OT_DEVICE_ROLE_CHILD:
        case OT_DEVICE_ROLE_ROUTER:
        case OT_DEVICE_ROLE_LEADER:
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            break;
        }
    }
}


