andersenthomas98/masteroppgave/nrf5sdk_thread/examples/multiprotocol/ble_thread/ble_thread_swi_template/main.c
/**@brief Enable OpenThread stack.
 */
static void thread_instance_init(void)
{
    thread_configuration_t thread_configuration =
    {
        .radio_mode        = THREAD_RADIO_MODE_RX_ON_WHEN_IDLE,
        .autocommissioning = true,
        .autostart_disable = false,
    };

    thread_init(&thread_configuration);
    thread_cli_init();
    thread_state_changed_callback_set(thread_state_changed_callback);

    uint32_t err_code = bsp_thread_init(thread_ot_instance_get());
    APP_ERROR_CHECK(err_code);

    m_connection_state = CONNECTION_STATE_THREAD;

    err_code = bsp_indication_set(BSP_THREAD_ENABLE);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_INFO("Current protocol: Thread\r\n");
}


/**@brief Switch from BLE to Thread.
 */
static void switch_ble_to_thread(void)
{
    ASSERT(m_connection_state == CONNECTION_STATE_BLE_DISABLE);

    ble_stack_deinit();
    thread_instance_init();
}


/**@brief Switch from Thread to BLE.
 */
static void switch_thread_to_ble(void)
{
    ASSERT(m_connection_state == CONNECTION_STATE_THREAD_DISABLE);

    thread_deinit();
    ble_stack_init();
}


/**@brief Execute appropriate action for current application state.
 */
static void application_fsm_process(void)
{
    uint32_t err_code;

    switch (m_connection_state)
    {
    case CONNECTION_STATE_BLE_DISCONNECT:
        err_code = sd_ble_gap_disconnect(m_conn_handle,
                                         BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);

        m_connection_state = CONNECTION_STATE_BLE_DISCONNECTING;
        break;

    case CONNECTION_STATE_BLE_DISABLE:
        switch_ble_to_thread();
        break;

    case CONNECTION_STATE_THREAD_DISABLE:
        switch_thread_to_ble();
        break;

    case CONNECTION_STATE_THREAD:
        thread_process();
        break;

    default:
        break;
    }
}


/**@brief Function for initializing scheduler module.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

/***************************************************************************************************
 * @section Main
 **************************************************************************************************/


/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize.
    log_init();
    scheduler_init();
    timers_init();
    buttons_leds_init(&m_erase_bonds);

    // Enable BLE protcol.
    ble_stack_init();

    // Start execution.
    NRF_LOG_INFO("BLE Thread template example started.");

    application_timers_start();

    // Enter main loop.
    while (true)
    {
        application_fsm_process();
        app_sched_execute();

        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}


/**
 * @}
 */
